open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_ota_rpmsg.c
/****************************************************************************
 * chips/bk7258/common/
 * bk7258_ota_rpmsg.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Versioned AP-source to CP Pair Installer transport.  RPMsg callbacks only
 * copy bounded messages and wake role-local task context.
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_BK7258_OTA_RPMSG

#include <errno.h>
#include <stdbool.h>
#include <sched.h>
#include <stddef.h>
#include <stdint.h>
#include <string.h>
#include <sys/types.h>

#include <nuttx/clock.h>
#include <nuttx/kthread.h>
#include <nuttx/mutex.h>
#include <nuttx/rpmsg/rpmsg.h>
#include <nuttx/semaphore.h>
#include <nuttx/signal.h>
#include <nuttx/spinlock.h>

#include <arch/chip/bk7258_ota.h>
#include <arch/chip/bk7258_ota_rpmsg.h>
#include <arch/chip/bk7258_usbmode.h>
#ifndef CONFIG_BK7258_AP_CORE
#  include <arch/chip/bk7258_system_reset.h>
#endif
#if defined(CONFIG_BK7258_AP_CORE) && defined(CONFIG_BK7258_OTA_SOURCE_FILE)
#  include <arch/chip/bk7258_ota_source_file.h>
#endif
#if defined(CONFIG_BK7258_AP_CORE) && defined(CONFIG_BK7258_OTA_SOURCE_HTTP)
#  include <arch/chip/bk7258_ota_source_http.h>
#endif
#include <arch/chip/bk7258_rptun.h>

#include "bk7258_rptun.h"

#define BK7258_OTA_RPMSG_EPT_NAME       "bk7258-ota-v2"
#define BK7258_OTA_RPMSG_MAGIC          0x32544f42u /* "BOT2" */
#define BK7258_OTA_RPMSG_VERSION        2u
#define BK7258_OTA_RPMSG_PAYLOAD_SIZE   432u
#define BK7258_OTA_RPMSG_SEND_MS        1000u
#define BK7258_OTA_RPMSG_CONTROL_ACK_MS 5000u

#ifdef CONFIG_BK7258_AP_CORE
#  define BK7258_OTA_RPMSG_REMOTE_NAME  "cp"
#else
#  define BK7258_OTA_RPMSG_REMOTE_NAME  "ap"
#endif

enum bk7258_ota_rpmsg_command_e
{
  BK7258_OTA_RPMSG_START = 1,
  BK7258_OTA_RPMSG_READ,
  BK7258_OTA_RPMSG_DATA,
  BK7258_OTA_RPMSG_PROGRESS,
  BK7258_OTA_RPMSG_CANCEL,
  BK7258_OTA_RPMSG_COMPLETE,
  BK7258_OTA_RPMSG_APPLY_FILE,
  BK7258_OTA_RPMSG_APPLY_HTTP,
  BK7258_OTA_RPMSG_MANAGER_STATUS,
  BK7258_OTA_RPMSG_MANAGER_CANCEL,
  BK7258_OTA_RPMSG_USBMODE_GET,
  BK7258_OTA_RPMSG_USBMODE_SET,
  BK7258_OTA_RPMSG_CONTROL_REPLY,
  BK7258_OTA_RPMSG_PAIR_STATUS,
  /* Keep the former REBOOT wire value as the non-destructive prepare step. */
  BK7258_OTA_RPMSG_REBOOT_PREPARE,
  BK7258_OTA_RPMSG_REBOOT_COMMIT
};

struct bk7258_ota_rpmsg_header_s
{
  uint32_t magic;
  uint16_t version;
  uint16_t command;
  uint32_t generation;
  uint32_t session;
  uint32_t sequence;
  uint32_t image;
  uint32_t offset;
  uint32_t length;
  int32_t status;
};

struct bk7258_ota_rpmsg_message_s
{
  struct bk7258_ota_rpmsg_header_s header;
  uint8_t payload[BK7258_OTA_RPMSG_PAYLOAD_SIZE];
};

struct bk7258_ota_rpmsg_dev_s
{
  struct rpmsg_endpoint ept;
  volatile bool initialized;
  volatile bool endpoint_created;
  volatile int connection_error;
  spinlock_t lock;
#ifdef CONFIG_BK7258_AP_CORE
  mutex_t session_lock;
  mutex_t control_lock;
  sem_t event_sem;
  sem_t lifecycle_sem;
  volatile bool stage_active;
  volatile bool cancel_requested;
  bool read_pending;
  bool progress_pending;
  bool complete_pending;
  struct bk7258_ota_rpmsg_header_s read_request;
  struct bk7258_ota_progress_s progress;
  uint32_t shared_progress_sequence;
  uint32_t complete_session;
  int complete_status;
  uint32_t next_session;
  const struct bk7258_ota_source_ops_s *source;
  void *source_context;
  uint32_t next_control_session;
  uint32_t waiting_control_session;
  bool control_reply_valid;
  uint32_t control_reply_length;
  int control_reply_status;
  uint8_t control_reply[BK7258_OTA_RPMSG_PAYLOAD_SIZE];
#if defined(CONFIG_BK7258_OTA_SOURCE_FILE) || \
    defined(CONFIG_BK7258_OTA_SOURCE_HTTP) || \
    defined(CONFIG_BK7258_USBMODE)
  sem_t control_sem;
  volatile bool control_busy;
  uint16_t control_command;
  uint32_t control_timeout_ms;
  char control_location[BK7258_OTA_CONTROL_URL_SIZE];
  char control_ca_path[BK7258_OTA_CONTROL_CA_SIZE];
#ifdef CONFIG_BK7258_USBMODE
  uint32_t control_session;
  enum bk7258_usbmode_e control_usbmode;
#endif
#endif
#else
  sem_t worker_sem;
  sem_t data_sem;
  sem_t control_sem;
  mutex_t control_lock;
  volatile bool stage_busy;
  volatile bool cancel_requested;
  struct bk7258_ota_manifest_s manifest;
  uint32_t active_session;
  uint32_t next_sequence;
  uint32_t waiting_sequence;
  bool data_valid;
  uint32_t data_length;
  int data_status;
  uint8_t data[BK7258_OTA_RPMSG_PAYLOAD_SIZE];
  uint32_t next_control_session;
  uint32_t waiting_control_session;
  bool control_reply_valid;
  uint32_t control_reply_length;
  int control_reply_status;
  uint8_t control_reply[BK7258_OTA_RPMSG_PAYLOAD_SIZE];
  bool lifecycle_pending;
  uint16_t lifecycle_command;
  uint32_t lifecycle_session;
  uint32_t lifecycle_generation;
  bool reboot_prepared;
  uint32_t reboot_prepared_session;
  uint32_t reboot_prepared_generation;
  uint32_t reboot_prepared_candidate_epoch;
  bool staged_candidate_ready;
  uint32_t staged_candidate_epoch;
#endif
};

static_assert(sizeof(struct bk7258_ota_rpmsg_header_s) == 36u,
              "BK7258 OTA RPMsg header ABI changed");
static_assert(sizeof(struct bk7258_ota_rpmsg_message_s) == 468u,
              "BK7258 OTA RPMsg message exceeds the 496-byte payload");
static_assert(sizeof(struct bk7258_ota_manifest_s) <=
              BK7258_OTA_RPMSG_PAYLOAD_SIZE,
              "BK7258 OTA manifest does not fit one START message");
static_assert(BK7258_OTA_CONTROL_PATH_SIZE <=
              BK7258_OTA_RPMSG_PAYLOAD_SIZE,
              "BK7258 OTA control path does not fit one message");
static_assert(BK7258_OTA_CONTROL_URL_SIZE + BK7258_OTA_CONTROL_CA_SIZE <=
              BK7258_OTA_RPMSG_PAYLOAD_SIZE,
              "BK7258 OTA HTTP control does not fit one message");
static_assert(sizeof(struct bk7258_ota_manager_status_s) <=
              BK7258_OTA_RPMSG_PAYLOAD_SIZE,
              "BK7258 OTA manager status does not fit one message");
static_assert(sizeof(struct bk7258_ota_pair_snapshot_s) <=
              BK7258_OTA_RPMSG_PAYLOAD_SIZE,
              "BK7258 OTA pair status does not fit one message");

