open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_ota_rpmsg.c
static struct bk7258_ota_rpmsg_dev_s g_bk7258_ota_rpmsg =
{
#ifdef CONFIG_BK7258_AP_CORE
  .session_lock = NXMUTEX_INITIALIZER,
  .control_lock = NXMUTEX_INITIALIZER,
#else
  .control_lock = NXMUTEX_INITIALIZER,
#endif
};

#define BK7258_OTA_SHARED_PROGRESS_MAGIC 0x50544f42u /* "BOTP" */
#define BK7258_OTA_SHARED_PROGRESS_VERSION 2u
#define BK7258_OTA_SHARED_PROGRESS_ADDR \
  (BK7258_RPTUN_RESOURCE_ADDR + BK7258_RPTUN_RESOURCE_SIZE)

struct bk7258_ota_shared_progress_s
{
  uint32_t magic;
  uint32_t version;
  uint32_t size;
  uint32_t generation;
  uint32_t session;
  volatile uint32_t sequence;
  int32_t status;
  uint32_t phase;
  uint32_t image;
  uint32_t operation;
  uint32_t completed;
  uint32_t total;
};

static_assert(sizeof(struct bk7258_ota_shared_progress_s) <=
              BK7258_RPTUN_CARVEOUT_OFFSET -
              (BK7258_RPTUN_RESOURCE_OFFSET +
               BK7258_RPTUN_RESOURCE_SIZE),
              "BK7258 OTA shared progress exceeds the resource gap");

#ifndef CONFIG_BK7258_AP_CORE
static void bk7258_ota_rpmsg_publish_progress(
  uint32_t session, const struct bk7258_ota_progress_s *progress)
{
  volatile struct bk7258_ota_shared_progress_s *shared =
    (volatile struct bk7258_ota_shared_progress_s *)
      BK7258_OTA_SHARED_PROGRESS_ADDR;
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();
  uint32_t sequence;

  sequence = __atomic_load_n((uint32_t *)(uintptr_t)&shared->sequence,
                             __ATOMIC_RELAXED);
  if ((sequence & 1u) != 0u)
    {
      sequence++;
    }

  __atomic_store_n((uint32_t *)(uintptr_t)&shared->sequence,
                   sequence + 1u, __ATOMIC_RELEASE);
  shared->magic = BK7258_OTA_SHARED_PROGRESS_MAGIC;
  shared->version = BK7258_OTA_SHARED_PROGRESS_VERSION;
  shared->size = sizeof(*shared);
  shared->generation = control->generation;
  shared->session = session;
  shared->status = 0;
  shared->phase = progress->phase;
  shared->image = progress->image;
  shared->operation = progress->operation;
  shared->completed = progress->completed;
  shared->total = progress->total;
  __asm volatile ("dmb sy" ::: "memory");
  __atomic_store_n((uint32_t *)(uintptr_t)&shared->sequence,
                   sequence + 2u, __ATOMIC_RELEASE);
}
#else
static bool bk7258_ota_rpmsg_snapshot_progress(
  uint32_t session, struct bk7258_ota_progress_s *progress,
  uint32_t *sequence)
{
  volatile struct bk7258_ota_shared_progress_s *shared =
    (volatile struct bk7258_ota_shared_progress_s *)
      BK7258_OTA_SHARED_PROGRESS_ADDR;
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();
  uint32_t first;
  uint32_t second;
  unsigned int attempt;

  for (attempt = 0; attempt < 3u; attempt++)
    {
      first = __atomic_load_n(
                (uint32_t *)(uintptr_t)&shared->sequence,
                __ATOMIC_ACQUIRE);
      if ((first & 1u) != 0u)
        {
          continue;
        }

      if (shared->magic != BK7258_OTA_SHARED_PROGRESS_MAGIC ||
          shared->version != BK7258_OTA_SHARED_PROGRESS_VERSION ||
          shared->size != sizeof(*shared) ||
          shared->generation != control->generation ||
          shared->session != session || shared->status < 0)
        {
          return false;
        }

      progress->phase = (enum bk7258_ota_phase_e)shared->phase;
      progress->image = (enum bk7258_ota_image_e)shared->image;
      progress->operation =
        (enum bk7258_ota_operation_e)shared->operation;
      progress->completed = shared->completed;
      progress->total = shared->total;
      __asm volatile ("dmb sy" ::: "memory");
      second = __atomic_load_n(
                 (uint32_t *)(uintptr_t)&shared->sequence,
                 __ATOMIC_ACQUIRE);
      if (first == second && (second & 1u) == 0u)
        {
          *sequence = second;
          return true;
        }
    }

  return false;
}

static void bk7258_ota_rpmsg_sync_progress(
  struct bk7258_ota_rpmsg_dev_s *priv)
{
  struct bk7258_ota_progress_s progress;
  uint32_t sequence;

  if (!__atomic_load_n(&priv->stage_active, __ATOMIC_ACQUIRE) ||
      priv->source == NULL || priv->source->checkpoint == NULL ||
      !bk7258_ota_rpmsg_snapshot_progress(priv->next_session,
                                           &progress, &sequence) ||
      sequence == priv->shared_progress_sequence)
    {
      return;
    }

  priv->shared_progress_sequence = sequence;
  (void)priv->source->checkpoint(priv->source_context, &progress);
}
#endif

static size_t bk7258_ota_rpmsg_size(uint32_t payload)
{
  return sizeof(struct bk7258_ota_rpmsg_header_s) + payload;
}

static void bk7258_ota_rpmsg_flush(sem_t *sem)
{
  while (nxsem_trywait(sem) == OK)
    {
    }
}

static bool bk7258_ota_rpmsg_ready(void)
{
  struct bk7258_ota_rpmsg_dev_s *priv = &g_bk7258_ota_rpmsg;
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();

  return __atomic_load_n(&priv->endpoint_created, __ATOMIC_ACQUIRE) &&
         control->state == BK7258_RPTUN_STATE_CONNECTED &&
         is_rpmsg_ept_ready(&priv->ept);
}

static int bk7258_ota_rpmsg_send(
  const struct bk7258_ota_rpmsg_message_s *msg, uint32_t payload)
{
  struct bk7258_ota_rpmsg_dev_s *priv = &g_bk7258_ota_rpmsg;
  clock_t start = clock_systime_ticks();
  clock_t limit = MSEC2TICK(BK7258_OTA_RPMSG_SEND_MS);
  int ret = -ENOTCONN;

  if (payload > BK7258_OTA_RPMSG_PAYLOAD_SIZE)
    {
      return -EMSGSIZE;
    }

  do
    {
      if (!bk7258_ota_rpmsg_ready())
        {
          return -ENOTCONN;
        }

      ret = rpmsg_trysend(&priv->ept, msg,
                          bk7258_ota_rpmsg_size(payload));
      if (ret >= 0)
        {
          return OK;
        }
      /* OpenAMP reports an exhausted TX ring with its own error code.
       * No message was accepted, so wait within the existing send deadline.
       */

      if (ret != RPMSG_ERR_NO_BUFF && ret != -ENOMEM && ret != -EAGAIN)
        {
          return ret;
        }

      nxsig_usleep(1000);
    }
  while ((clock_t)(clock_systime_ticks() - start) < limit);

