open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_ota_rpmsg.c
  return -ETIMEDOUT;
}

static void bk7258_ota_rpmsg_header(
  struct bk7258_ota_rpmsg_header_s *header, uint16_t command,
  uint32_t session)
{
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();

  memset(header, 0, sizeof(*header));
  header->magic = BK7258_OTA_RPMSG_MAGIC;
  header->version = BK7258_OTA_RPMSG_VERSION;
  header->command = command;
  header->generation = control->generation;
  header->session = session;
}

static bool bk7258_ota_rpmsg_valid(
  const struct bk7258_ota_rpmsg_message_s *msg, size_t len)
{
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();
  size_t payload;

  if (msg == NULL || len < sizeof(msg->header) ||
      len > sizeof(*msg))
    {
      return false;
    }

  payload = len - sizeof(msg->header);
  if (msg->header.magic != BK7258_OTA_RPMSG_MAGIC ||
      msg->header.version != BK7258_OTA_RPMSG_VERSION ||
      msg->header.generation == 0u ||
      msg->header.generation != control->generation ||
      msg->header.session == 0u)
    {
      return false;
    }

  switch (msg->header.command)
    {
      case BK7258_OTA_RPMSG_START:
        return payload == sizeof(struct bk7258_ota_manifest_s) &&
               msg->header.length == payload;

      case BK7258_OTA_RPMSG_DATA:
        return payload == msg->header.length &&
               payload <= BK7258_OTA_RPMSG_PAYLOAD_SIZE;

      case BK7258_OTA_RPMSG_APPLY_FILE:
        return payload == msg->header.length && payload >= 2u &&
               payload <= BK7258_OTA_CONTROL_PATH_SIZE;

      case BK7258_OTA_RPMSG_APPLY_HTTP:
        return payload == msg->header.length && payload >= 3u &&
               payload <= BK7258_OTA_CONTROL_URL_SIZE +
                          BK7258_OTA_CONTROL_CA_SIZE;

      case BK7258_OTA_RPMSG_CONTROL_REPLY:
        return payload == msg->header.length &&
               (payload == 0u ||
                payload == sizeof(uint32_t) ||
                payload == sizeof(struct bk7258_ota_manager_status_s) ||
                payload == sizeof(struct bk7258_ota_pair_snapshot_s));

      case BK7258_OTA_RPMSG_USBMODE_SET:
        return payload == sizeof(uint32_t) &&
               msg->header.length == payload;

      case BK7258_OTA_RPMSG_READ:
      case BK7258_OTA_RPMSG_PROGRESS:
      case BK7258_OTA_RPMSG_CANCEL:
      case BK7258_OTA_RPMSG_COMPLETE:
      case BK7258_OTA_RPMSG_MANAGER_STATUS:
      case BK7258_OTA_RPMSG_MANAGER_CANCEL:
      case BK7258_OTA_RPMSG_USBMODE_GET:
      case BK7258_OTA_RPMSG_PAIR_STATUS:
      case BK7258_OTA_RPMSG_REBOOT_PREPARE:
      case BK7258_OTA_RPMSG_REBOOT_COMMIT:
        return payload == 0u;

      default:
        return false;
    }
}

#ifdef CONFIG_BK7258_AP_CORE

static int bk7258_ota_rpmsg_control_reply(uint32_t session, int status,
                                          const void *payload,
                                          uint32_t length, bool blocking)
{
  struct bk7258_ota_rpmsg_dev_s *priv = &g_bk7258_ota_rpmsg;
  struct bk7258_ota_rpmsg_message_s reply;
  int ret;

  if ((payload == NULL) != (length == 0u) ||
      length > sizeof(reply.payload))
    {
      return -EINVAL;
    }

  memset(&reply, 0, sizeof(reply));
  bk7258_ota_rpmsg_header(&reply.header,
                          BK7258_OTA_RPMSG_CONTROL_REPLY, session);
  reply.header.status = status;
  reply.header.length = length;
  if (length > 0u)
    {
      memcpy(reply.payload, payload, length);
    }

  if (blocking)
    {
      return bk7258_ota_rpmsg_send(&reply, length);
    }

  ret = rpmsg_trysend(&priv->ept, &reply, bk7258_ota_rpmsg_size(length));
  return ret < 0 ? ret : OK;
}

/* The caller owns control_lock.  A nonzero *session reuses the prepare
 * session for its matching commit; otherwise this helper allocates one. */

static int bk7258_ota_rpmsg_cp_control_request_locked(
  uint16_t command, uint32_t *session, uint32_t timeout_ms, void *reply,
  uint32_t reply_size)
{
  struct bk7258_ota_rpmsg_dev_s *priv = &g_bk7258_ota_rpmsg;
  struct bk7258_ota_rpmsg_message_s request;
  irqstate_t flags;
  int ret;

  if (session == NULL || (reply == NULL) != (reply_size == 0u) ||
      reply_size > BK7258_OTA_RPMSG_PAYLOAD_SIZE || timeout_ms == 0u)
    {
      return -EINVAL;
    }

  if (!bk7258_ota_rpmsg_ready())
    {
      return -ENOTCONN;
    }

  if (*session == 0u && ++priv->next_control_session == 0u)
    {
      priv->next_control_session++;
    }

  if (*session == 0u)
    {
      *session = priv->next_control_session;
    }

  bk7258_ota_rpmsg_flush(&priv->lifecycle_sem);
  flags = spin_lock_irqsave(&priv->lock);
  priv->waiting_control_session = *session;
  priv->control_reply_valid = false;
  priv->control_reply_length = 0u;
  priv->control_reply_status = -EINPROGRESS;
  spin_unlock_irqrestore(&priv->lock, flags);

  memset(&request, 0, sizeof(request));
  bk7258_ota_rpmsg_header(&request.header, command, *session);
  ret = bk7258_ota_rpmsg_send(&request, 0u);
  if (ret < 0)
    {
      goto out_clear;
    }

  ret = nxsem_tickwait_uninterruptible(&priv->lifecycle_sem,
                                        MSEC2TICK(timeout_ms));
  if (ret < 0)
    {
      goto out_clear;
    }

  flags = spin_lock_irqsave(&priv->lock);
  if (!priv->control_reply_valid)
    {
      ret = -ESTALE;
    }
  else
    {
      ret = priv->control_reply_status;
      if (reply != NULL)
        {
          if (priv->control_reply_length == reply_size)
            {
              memcpy(reply, priv->control_reply, reply_size);
            }
          else if (ret >= 0 || priv->control_reply_length != 0u)
            {
              ret = -EPROTO;
            }
        }
      else if (priv->control_reply_length != 0u)
        {
          ret = -EPROTO;
        }
    }
  spin_unlock_irqrestore(&priv->lock, flags);

out_clear:
  flags = spin_lock_irqsave(&priv->lock);
  priv->waiting_control_session = 0u;
  priv->control_reply_valid = false;
  spin_unlock_irqrestore(&priv->lock, flags);
  return ret;
}

static int bk7258_ota_rpmsg_cp_control_request(
  uint16_t command, uint32_t timeout_ms, void *reply, uint32_t reply_size)
{
  struct bk7258_ota_rpmsg_dev_s *priv = &g_bk7258_ota_rpmsg;
  uint32_t session = 0u;
  int ret;

  ret = nxmutex_lock(&priv->control_lock);
  if (ret < 0)
    {
      return ret;
    }

