open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_ota_rpmsg.c
  ret = bk7258_ota_rpmsg_cp_control_request_locked(
          command, &session, timeout_ms, reply, reply_size);
  nxmutex_unlock(&priv->control_lock);
  return ret;
}

#if defined(CONFIG_BK7258_OTA_SOURCE_FILE) || \
    defined(CONFIG_BK7258_OTA_SOURCE_HTTP) || \
    defined(CONFIG_BK7258_USBMODE)
static int bk7258_ota_rpmsg_control_worker(int argc, char *argv[])
{
  struct bk7258_ota_rpmsg_dev_s *priv = &g_bk7258_ota_rpmsg;

  (void)argc;
  (void)argv;
  for (;;)
    {
      uint16_t command;
      uint32_t timeout_ms;
#ifdef CONFIG_BK7258_USBMODE
      uint32_t session;
      enum bk7258_usbmode_e usbmode;
#endif
      char location[BK7258_OTA_CONTROL_URL_SIZE];
      char ca_path[BK7258_OTA_CONTROL_CA_SIZE];
      bool manager_called = false;
      int ret = -ENOSYS;

      if (nxsem_wait_uninterruptible(&priv->control_sem) < 0)
        {
          continue;
        }

      command = priv->control_command;
      timeout_ms = priv->control_timeout_ms;
#ifdef CONFIG_BK7258_USBMODE
      session = priv->control_session;
      usbmode = priv->control_usbmode;
#endif
      memcpy(location, priv->control_location, sizeof(location));
      memcpy(ca_path, priv->control_ca_path, sizeof(ca_path));
      __asm volatile ("dmb sy" ::: "memory");

#ifdef CONFIG_BK7258_USBMODE
      if (command == BK7258_OTA_RPMSG_USBMODE_SET)
        {
          enum bk7258_usbmode_e actual;
          uint32_t wire_actual;

          ret = bk7258_usbmode_set(usbmode);
          actual = bk7258_usbmode_get();
          wire_actual = (uint32_t)actual;
          (void)bk7258_ota_rpmsg_control_reply(
                  session, ret, &wire_actual, sizeof(wire_actual), true);
          __atomic_store_n(&priv->control_busy, false,
                           __ATOMIC_RELEASE);
          continue;
        }
#endif

#ifdef CONFIG_BK7258_OTA_SOURCE_FILE
      if (command == BK7258_OTA_RPMSG_APPLY_FILE)
        {
          struct bk7258_ota_file_source_s source;

          ret = bk7258_ota_file_source_initialize(&source, location);
          if (ret == 0)
            {
              manager_called = true;
              ret = bk7258_ota_manager_apply(
                      bk7258_ota_file_source_ops(), &source, timeout_ms);
            }
        }
#endif

#ifdef CONFIG_BK7258_OTA_SOURCE_HTTP
      if (command == BK7258_OTA_RPMSG_APPLY_HTTP)
        {
          struct bk7258_ota_http_source_s source = {0};

          ret = bk7258_ota_http_source_initialize(
                  &source, location, ca_path);
          if (ret == 0)
            {
              manager_called = true;
              ret = bk7258_ota_manager_apply(
                      bk7258_ota_http_source_ops(), &source, timeout_ms);
            }
        }
#endif

      if (ret < 0 && !manager_called)
        {
          (void)bk7258_ota_manager_report_failure(ret);
        }
      __atomic_store_n(&priv->control_busy, false, __ATOMIC_RELEASE);
    }

  return 0;
}
#endif

static int bk7258_ota_rpmsg_send_cancel(uint32_t session)
{
  struct bk7258_ota_rpmsg_message_s msg;

  bk7258_ota_rpmsg_header(&msg.header, BK7258_OTA_RPMSG_CANCEL, session);
  return bk7258_ota_rpmsg_send(&msg, 0u);
}

static int bk7258_ota_rpmsg_serve_read(
  struct bk7258_ota_rpmsg_dev_s *priv,
  const struct bk7258_ota_rpmsg_header_s *request)
{
  struct bk7258_ota_rpmsg_message_s reply;
  int ret;

  bk7258_ota_rpmsg_header(&reply.header, BK7258_OTA_RPMSG_DATA,
                          request->session);
  reply.header.sequence = request->sequence;
  reply.header.image = request->image;
  reply.header.offset = request->offset;
  if (request->image > BK7258_OTA_IMAGE_AP || request->length == 0u ||
      request->length > sizeof(reply.payload) || priv->source == NULL)
    {
      reply.header.status = -EINVAL;
      return bk7258_ota_rpmsg_send(&reply, 0u);
    }

  ret = priv->source->read_at(priv->source_context,
                              (enum bk7258_ota_image_e)request->image,
                              request->offset, reply.payload,
                              request->length);
  if (ret != 0)
    {
      reply.header.status = ret < 0 ? ret : -EIO;
      return bk7258_ota_rpmsg_send(&reply, 0u);
    }

  reply.header.length = request->length;
  return bk7258_ota_rpmsg_send(&reply, request->length);
}

int bk7258_ota_rpmsg_stage(const struct bk7258_ota_source_ops_s *source,
                           void *context, uint32_t timeout_ms)
{
  struct bk7258_ota_rpmsg_dev_s *priv = &g_bk7258_ota_rpmsg;
  struct bk7258_ota_rpmsg_message_s start_msg;
  struct bk7258_ota_manifest_s manifest;
  clock_t started;
  clock_t limit;
  bool opened = false;
  int ret;

  if (source == NULL || source->open == NULL || source->read_at == NULL ||
      timeout_ms == 0u)
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&priv->session_lock);
  if (ret < 0)
    {
      return ret;
    }

  if (!bk7258_ota_rpmsg_ready())
    {
      ret = -ENOTCONN;
      goto out_source;
    }

  memset(&manifest, 0, sizeof(manifest));
  opened = true;
  ret = source->open(context, &manifest);
  if (ret != 0)
    {
      ret = ret < 0 ? ret : -EIO;
      goto out_source;
    }

  if (++priv->next_session == 0u)
    {
      priv->next_session++;
    }

  bk7258_ota_rpmsg_flush(&priv->event_sem);
  priv->source = source;
  priv->source_context = context;
  priv->cancel_requested = false;
  priv->read_pending = false;
  priv->progress_pending = false;
  priv->complete_pending = false;
  priv->shared_progress_sequence = 0u;
  __atomic_store_n(&priv->stage_active, true, __ATOMIC_RELEASE);

  memset(&start_msg, 0, sizeof(start_msg));
  bk7258_ota_rpmsg_header(&start_msg.header, BK7258_OTA_RPMSG_START,
                          priv->next_session);
  start_msg.header.length = sizeof(manifest);
  memcpy(start_msg.payload, &manifest, sizeof(manifest));
  ret = bk7258_ota_rpmsg_send(&start_msg, sizeof(manifest));
  if (ret < 0)
    {
      goto out_active;
    }

  started = clock_systime_ticks();
  limit = MSEC2TICK(timeout_ms);
  for (;;)
    {
      struct bk7258_ota_rpmsg_header_s read_request;
      struct bk7258_ota_progress_s progress;
      bool have_read;
      bool have_progress;
      bool have_complete;
      irqstate_t flags;
      clock_t elapsed = clock_systime_ticks() - started;

      if (elapsed >= limit)
        {
          ret = -ETIMEDOUT;
          (void)bk7258_ota_rpmsg_send_cancel(priv->next_session);
          break;
        }

      ret = nxsem_tickwait_uninterruptible(&priv->event_sem,
                                            limit - elapsed);
      if (ret < 0)
        {
          (void)bk7258_ota_rpmsg_send_cancel(priv->next_session);
          break;
        }

      flags = spin_lock_irqsave(&priv->lock);
      have_read = priv->read_pending;
      have_progress = priv->progress_pending;
      have_complete = priv->complete_pending;
      if (have_read)
        {
          read_request = priv->read_request;
          priv->read_pending = false;
        }
      if (have_progress)
        {
          progress = priv->progress;
          priv->progress_pending = false;
        }
      if (have_complete)
        {
          priv->complete_pending = false;
        }
      spin_unlock_irqrestore(&priv->lock, flags);

      bk7258_ota_rpmsg_sync_progress(priv);

      if (have_read)
        {
          ret = bk7258_ota_rpmsg_serve_read(priv, &read_request);
          if (ret < 0)
            {
              (void)bk7258_ota_rpmsg_send_cancel(priv->next_session);
              break;
            }
        }

      if (have_progress && source->checkpoint != NULL)
        {
          ret = source->checkpoint(context, &progress);
          if (ret < 0)
            {
              __atomic_store_n(&priv->cancel_requested, true,
                               __ATOMIC_RELEASE);
              (void)bk7258_ota_rpmsg_send_cancel(priv->next_session);
            }
        }

      if (__atomic_exchange_n(&priv->cancel_requested, false,
                              __ATOMIC_ACQ_REL))
        {
          ret = -ECANCELED;
          (void)bk7258_ota_rpmsg_send_cancel(priv->next_session);
        }

      if (have_complete && priv->complete_session == priv->next_session)
        {
          ret = priv->complete_status;
          break;
        }
    }

