open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_ota_rpmsg.c
out_active:
  __atomic_store_n(&priv->stage_active, false, __ATOMIC_RELEASE);
  priv->source = NULL;
  priv->source_context = NULL;
out_source:
  if (ret < 0 && opened && source->cancel != NULL)
    {
      (void)source->cancel(context);
    }
  if (source->close != NULL)
    {
      source->close(context);
    }
  nxmutex_unlock(&priv->session_lock);
  return ret;
}

int bk7258_ota_rpmsg_cancel(void)
{
  struct bk7258_ota_rpmsg_dev_s *priv = &g_bk7258_ota_rpmsg;

  if (!__atomic_load_n(&priv->stage_active, __ATOMIC_ACQUIRE))
    {
      return -ENOENT;
    }

  __atomic_store_n(&priv->cancel_requested, true, __ATOMIC_RELEASE);
  (void)nxsem_post(&priv->event_sem);
  return OK;
}

int bk7258_ota_rpmsg_pair_status(
  struct bk7258_ota_pair_snapshot_s *snapshot, uint32_t timeout_ms)
{
  if (snapshot == NULL)
    {
      return -EINVAL;
    }

  return bk7258_ota_rpmsg_cp_control_request(
           BK7258_OTA_RPMSG_PAIR_STATUS, timeout_ms, snapshot,
           sizeof(*snapshot));
}

int bk7258_ota_rpmsg_reboot(uint32_t timeout_ms)
{
  struct bk7258_ota_rpmsg_dev_s *priv = &g_bk7258_ota_rpmsg;
  struct bk7258_ota_rpmsg_message_s commit;
  uint32_t session = 0u;
  int ret;

  ret = nxmutex_lock(&priv->control_lock);
  if (ret < 0)
    {
      return ret;
    }

  /* A failed or lost prepare has no side effect on CP.  Only a caller that
   * received this reply can submit the session-bound commit below. */

  ret = bk7258_ota_rpmsg_cp_control_request_locked(
          BK7258_OTA_RPMSG_REBOOT_PREPARE, &session, timeout_ms, NULL, 0u);
  if (ret >= 0)
    {
      memset(&commit, 0, sizeof(commit));
      bk7258_ota_rpmsg_header(&commit.header,
                              BK7258_OTA_RPMSG_REBOOT_COMMIT, session);
      ret = bk7258_ota_rpmsg_send(&commit, 0u);
    }

  nxmutex_unlock(&priv->control_lock);
  return ret;
}

#else /* CONFIG_BK7258_AP_CORE */

static int bk7258_ota_rpmsg_control_reply(uint32_t session, int status,
                                          const void *payload,
                                          uint32_t length, bool blocking)
{
  struct bk7258_ota_rpmsg_dev_s *priv = &g_bk7258_ota_rpmsg;
  struct bk7258_ota_rpmsg_message_s reply;
  int ret;

  if ((payload == NULL) != (length == 0u) ||
      length > sizeof(reply.payload))
    {
      return -EINVAL;
    }

  memset(&reply, 0, sizeof(reply));
  bk7258_ota_rpmsg_header(&reply.header,
                          BK7258_OTA_RPMSG_CONTROL_REPLY, session);
  reply.header.status = status;
  reply.header.length = length;
  if (length > 0u)
    {
      memcpy(reply.payload, payload, length);
    }

  if (blocking)
    {
      return bk7258_ota_rpmsg_send(&reply, length);
    }

  ret = rpmsg_trysend(&priv->ept, &reply, bk7258_ota_rpmsg_size(length));
  return ret < 0 ? ret : OK;
}

struct bk7258_ota_rpmsg_source_s
{
  struct bk7258_ota_rpmsg_dev_s *dev;
  uint32_t session;
};

static int bk7258_ota_rpmsg_source_open(
  void *context, struct bk7258_ota_manifest_s *manifest)
{
  struct bk7258_ota_rpmsg_source_s *source = context;

  memcpy(manifest, &source->dev->manifest, sizeof(*manifest));
  return OK;
}

static int bk7258_ota_rpmsg_source_read(
  void *context, enum bk7258_ota_image_e image, uint32_t offset,
  uint8_t *buffer, size_t nbytes)
{
  struct bk7258_ota_rpmsg_source_s *source = context;
  struct bk7258_ota_rpmsg_dev_s *priv = source->dev;
  size_t done = 0u;

  while (done < nbytes)
    {
      struct bk7258_ota_rpmsg_message_s request;
      uint32_t count = nbytes - done;
      int ret;

      if (__atomic_load_n(&priv->cancel_requested, __ATOMIC_ACQUIRE))
        {
          return -ECANCELED;
        }
      if (count > BK7258_OTA_RPMSG_PAYLOAD_SIZE)
        {
          count = BK7258_OTA_RPMSG_PAYLOAD_SIZE;
        }
      if (++priv->next_sequence == 0u)
        {
          priv->next_sequence++;
        }

      bk7258_ota_rpmsg_flush(&priv->data_sem);
      priv->waiting_sequence = priv->next_sequence;
      priv->data_valid = false;
      priv->data_status = -EINPROGRESS;
      bk7258_ota_rpmsg_header(&request.header, BK7258_OTA_RPMSG_READ,
                              source->session);
      request.header.sequence = priv->next_sequence;
      request.header.image = image;
      request.header.offset = offset + done;
      request.header.length = count;
      ret = bk7258_ota_rpmsg_send(&request, 0u);
      if (ret < 0)
        {
          return ret;
        }

      ret = nxsem_tickwait_uninterruptible(
              &priv->data_sem,
              MSEC2TICK(CONFIG_BK7258_OTA_RPMSG_READ_TIMEOUT_MS));
      if (ret < 0)
        {
          return ret;
        }

      __asm volatile ("dmb sy" ::: "memory");
      if (__atomic_load_n(&priv->cancel_requested, __ATOMIC_ACQUIRE))
        {
          return -ECANCELED;
        }
      if (!priv->data_valid || priv->data_status < 0 ||
          priv->data_length != count)
        {
          return priv->data_status < 0 ? priv->data_status : -ESTALE;
        }

      memcpy(buffer + done, priv->data, count);
      done += count;
    }

  return OK;
}

static int bk7258_ota_rpmsg_source_checkpoint(
  void *context, const struct bk7258_ota_progress_s *progress)
{
  struct bk7258_ota_rpmsg_source_s *source = context;
  struct bk7258_ota_rpmsg_dev_s *priv = source->dev;

  if (__atomic_load_n(&priv->cancel_requested, __ATOMIC_ACQUIRE))
    {
      return -ECANCELED;
    }

  bk7258_ota_rpmsg_publish_progress(source->session, progress);
  return OK;
}

static int bk7258_ota_rpmsg_source_cancel(void *context)
{
  (void)context;
  return OK;
}

static void bk7258_ota_rpmsg_source_close(void *context)
{
  (void)context;
}

static const struct bk7258_ota_source_ops_s g_bk7258_ota_proxy_ops =
{
  .open = bk7258_ota_rpmsg_source_open,
  .read_at = bk7258_ota_rpmsg_source_read,
  .checkpoint = bk7258_ota_rpmsg_source_checkpoint,
  .cancel = bk7258_ota_rpmsg_source_cancel,
  .close = bk7258_ota_rpmsg_source_close,
};

static int bk7258_ota_rpmsg_control_request(
  uint16_t command, const void *payload, uint32_t length,
  uint32_t operation_timeout_ms,
  void *reply, uint32_t reply_size)
{
  struct bk7258_ota_rpmsg_dev_s *priv = &g_bk7258_ota_rpmsg;
  struct bk7258_ota_rpmsg_message_s request;
  uint32_t wait_ms;
  irqstate_t flags;
  int ret;

  if ((payload == NULL) != (length == 0u) ||
      (reply == NULL) != (reply_size == 0u) ||
      length > sizeof(request.payload) || operation_timeout_ms == 0u)
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&priv->control_lock);
  if (ret < 0)
    {
      return ret;
    }

  if (!bk7258_ota_rpmsg_ready())
    {
      ret = -ENOTCONN;
      goto out_unlock;
    }

  if (++priv->next_control_session == 0u)
    {
      priv->next_control_session++;
    }

  bk7258_ota_rpmsg_flush(&priv->control_sem);
  flags = spin_lock_irqsave(&priv->lock);
  priv->waiting_control_session = priv->next_control_session;
  priv->control_reply_valid = false;
  priv->control_reply_length = 0u;
  priv->control_reply_status = -EINPROGRESS;
  spin_unlock_irqrestore(&priv->lock, flags);

