open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_ota_rpmsg.c
  memset(&request, 0, sizeof(request));
  bk7258_ota_rpmsg_header(&request.header, command,
                          priv->next_control_session);
  request.header.offset = operation_timeout_ms;
  request.header.length = length;
  if (length > 0u)
    {
      memcpy(request.payload, payload, length);
    }

  ret = bk7258_ota_rpmsg_send(&request, length);
  if (ret < 0)
    {
      goto out_clear;
    }

  if (command == BK7258_OTA_RPMSG_APPLY_FILE ||
      command == BK7258_OTA_RPMSG_APPLY_HTTP)
    {
      wait_ms = BK7258_OTA_RPMSG_CONTROL_ACK_MS;
    }
  else
    {
      wait_ms = operation_timeout_ms > UINT32_MAX - 5000u ?
                UINT32_MAX : operation_timeout_ms + 5000u;
    }
  ret = nxsem_tickwait_uninterruptible(&priv->control_sem,
                                        MSEC2TICK(wait_ms));
  if (ret < 0)
    {
      goto out_clear;
    }

  flags = spin_lock_irqsave(&priv->lock);
  if (!priv->control_reply_valid)
    {
      ret = -ESTALE;
    }
  else
    {
      ret = priv->control_reply_status;
      if (reply != NULL)
        {
          if (priv->control_reply_length == reply_size)
            {
              memcpy(reply, priv->control_reply, reply_size);
            }
          else if (ret >= 0 || priv->control_reply_length != 0u)
            {
              ret = -EPROTO;
            }
        }
      else if (priv->control_reply_length != 0u)
        {
          ret = -EPROTO;
        }
    }
  spin_unlock_irqrestore(&priv->lock, flags);

out_clear:
  flags = spin_lock_irqsave(&priv->lock);
  priv->waiting_control_session = 0u;
  priv->control_reply_valid = false;
  spin_unlock_irqrestore(&priv->lock, flags);
out_unlock:
  nxmutex_unlock(&priv->control_lock);
  return ret;
}

int bk7258_ota_rpmsg_apply_file(const char *root, uint32_t timeout_ms)
{
  size_t length;

  if (root == NULL || timeout_ms == 0u)
    {
      return -EINVAL;
    }

  length = strnlen(root, BK7258_OTA_CONTROL_PATH_SIZE);
  if (length == 0u || length >= BK7258_OTA_CONTROL_PATH_SIZE)
    {
      return -ENAMETOOLONG;
    }

  return bk7258_ota_rpmsg_control_request(
           BK7258_OTA_RPMSG_APPLY_FILE, root, length + 1u,
           timeout_ms, NULL, 0u);
}

int bk7258_ota_rpmsg_apply_http(const char *catalog_url,
                                const char *ca_path,
                                uint32_t timeout_ms)
{
  uint8_t payload[BK7258_OTA_CONTROL_URL_SIZE +
                  BK7258_OTA_CONTROL_CA_SIZE];
  size_t url_length;
  size_t ca_length;

  if (catalog_url == NULL || ca_path == NULL || timeout_ms == 0u)
    {
      return -EINVAL;
    }

  url_length = strnlen(catalog_url, BK7258_OTA_CONTROL_URL_SIZE);
  ca_length = strnlen(ca_path, BK7258_OTA_CONTROL_CA_SIZE);
  if (url_length == 0u || url_length >= BK7258_OTA_CONTROL_URL_SIZE ||
      ca_length >= BK7258_OTA_CONTROL_CA_SIZE)
    {
      return -ENAMETOOLONG;
    }

  memcpy(payload, catalog_url, url_length + 1u);
  memcpy(payload + url_length + 1u, ca_path, ca_length + 1u);
  return bk7258_ota_rpmsg_control_request(
           BK7258_OTA_RPMSG_APPLY_HTTP, payload,
           url_length + ca_length + 2u, timeout_ms, NULL, 0u);
}

int bk7258_ota_rpmsg_manager_status(
  struct bk7258_ota_manager_status_s *status, uint32_t timeout_ms)
{
  if (status == NULL)
    {
      return -EINVAL;
    }

  return bk7258_ota_rpmsg_control_request(
           BK7258_OTA_RPMSG_MANAGER_STATUS, NULL, 0u,
           timeout_ms, status, sizeof(*status));
}

int bk7258_ota_rpmsg_manager_cancel(uint32_t timeout_ms)
{
  return bk7258_ota_rpmsg_control_request(
           BK7258_OTA_RPMSG_MANAGER_CANCEL, NULL, 0u,
           timeout_ms, NULL, 0u);
}

int bk7258_ota_rpmsg_usbmode_get(enum bk7258_usbmode_e *mode,
                                 uint32_t timeout_ms)
{
  uint32_t wire_mode;
  int ret;

  if (mode == NULL)
    {
      return -EINVAL;
    }

  ret = bk7258_ota_rpmsg_control_request(
          BK7258_OTA_RPMSG_USBMODE_GET, NULL, 0u,
          timeout_ms, &wire_mode, sizeof(wire_mode));
  if (ret < 0)
    {
      return ret;
    }

  if (wire_mode != (uint32_t)BK7258_USBMODE_CDC &&
      wire_mode != (uint32_t)BK7258_USBMODE_MSC)
    {
      return -EPROTO;
    }

  *mode = (enum bk7258_usbmode_e)wire_mode;
  return OK;
}

int bk7258_ota_rpmsg_usbmode_set(enum bk7258_usbmode_e mode,
                                 enum bk7258_usbmode_e *actual,
                                 uint32_t timeout_ms)
{
  uint32_t wire_actual = (uint32_t)BK7258_USBMODE_NONE;
  uint32_t wire_mode;
  int ret;

  if ((mode != BK7258_USBMODE_CDC && mode != BK7258_USBMODE_MSC) ||
      actual == NULL)
    {
      return -EINVAL;
    }

  wire_mode = (uint32_t)mode;
  ret = bk7258_ota_rpmsg_control_request(
          BK7258_OTA_RPMSG_USBMODE_SET, &wire_mode, sizeof(wire_mode),
          timeout_ms, &wire_actual, sizeof(wire_actual));
  if (wire_actual == (uint32_t)BK7258_USBMODE_CDC ||
      wire_actual == (uint32_t)BK7258_USBMODE_MSC)
    {
      *actual = (enum bk7258_usbmode_e)wire_actual;
    }

  if (ret < 0)
    {
      return ret;
    }

  return wire_actual == (uint32_t)BK7258_USBMODE_CDC ||
         wire_actual == (uint32_t)BK7258_USBMODE_MSC ? OK : -EPROTO;
}

static int bk7258_ota_rpmsg_lifecycle_worker(
  uint16_t command, uint32_t session, uint32_t generation)
{
  struct bk7258_ota_rpmsg_dev_s *priv = &g_bk7258_ota_rpmsg;
  struct bk7258_ota_pair_snapshot_s snapshot;
  volatile struct bk7258_rptun_control_s *control = bk7258_rptun_control();
  bool endpoint_ready;
  bool staged_reboot_allowed;
  uint32_t candidate_epoch;
  irqstate_t flags;
  int operation;
  int ret;

  memset(&snapshot, 0, sizeof(snapshot));
  operation = bk7258_ota_get_active_pair(&snapshot);
  endpoint_ready = bk7258_ota_rpmsg_ready();
  flags = spin_lock_irqsave(&priv->lock);
  candidate_epoch = priv->staged_candidate_epoch;
  staged_reboot_allowed =
    priv->staged_candidate_ready && operation == OK &&
    snapshot.state == BK7258_OTA_PAIR_CONFIRMED &&
    snapshot.security_counter_present &&
    priv->manifest.security_counter > snapshot.security_counter &&
    bk7258_mcuboot_version_compare(&priv->manifest.image_version,
                                   &snapshot.version) > 0;
  spin_unlock_irqrestore(&priv->lock, flags);
  if (command == BK7258_OTA_RPMSG_PAIR_STATUS)
    {
      ret = bk7258_ota_rpmsg_control_reply(
              session, operation, operation == OK ? &snapshot : NULL,
              operation == OK ? sizeof(snapshot) : 0u, true);
      __atomic_store_n(&priv->stage_busy, false, __ATOMIC_RELEASE);
      return ret;
    }

  if (command == BK7258_OTA_RPMSG_REBOOT_PREPARE)
    {
      flags = spin_lock_irqsave(&priv->lock);
      priv->reboot_prepared = false;
      if (staged_reboot_allowed && endpoint_ready &&
          control->generation == generation)
        {
          priv->reboot_prepared = true;
          priv->reboot_prepared_session = session;
          priv->reboot_prepared_generation = generation;
          priv->reboot_prepared_candidate_epoch = candidate_epoch;
        }
      else if (operation == OK)
        {
          operation = -EPERM;
        }
      spin_unlock_irqrestore(&priv->lock, flags);

      ret = bk7258_ota_rpmsg_control_reply(session, operation, NULL, 0u,
                                           true);
      if (ret < 0)
        {
          flags = spin_lock_irqsave(&priv->lock);
          if (priv->reboot_prepared &&
              priv->reboot_prepared_session == session &&
              priv->reboot_prepared_generation == generation)
            {
              priv->reboot_prepared = false;
            }
          spin_unlock_irqrestore(&priv->lock, flags);
        }
      __atomic_store_n(&priv->stage_busy, false, __ATOMIC_RELEASE);
      return ret < 0 ? ret : operation;
    }

  if (command != BK7258_OTA_RPMSG_REBOOT_COMMIT)
    {
      __atomic_store_n(&priv->stage_busy, false, __ATOMIC_RELEASE);
      return -ENOMSG;
    }

  /* Consume the prepare token before the potentially slow flash query.  A
   * duplicate commit cannot be queued while stage_busy is set, and a later
   * commit cannot reuse this token after it has been consumed. */

  flags = spin_lock_irqsave(&priv->lock);
  if (!priv->reboot_prepared ||
      priv->reboot_prepared_session != session ||
      priv->reboot_prepared_generation != generation ||
      priv->reboot_prepared_candidate_epoch != candidate_epoch ||
      !priv->staged_candidate_ready ||
      !endpoint_ready || control->generation != generation)
    {
      operation = -ESTALE;
    }
  else
    {
      priv->reboot_prepared = false;
      priv->staged_candidate_ready = false;
    }
  spin_unlock_irqrestore(&priv->lock, flags);

  if (operation == OK && !staged_reboot_allowed)
    {
      operation = -EPERM;
    }

