open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_ota_rpmsg.c
  if (operation < 0)
    {
      __atomic_store_n(&priv->stage_busy, false, __ATOMIC_RELEASE);
      return operation;
    }

  /* AP has already received PREPARE and committed the matching session. */
  bk7258_system_reset(BK7258_RESET_SOURCE_REBOOT);
}

static int bk7258_ota_rpmsg_worker(int argc, char *argv[])
{
  struct bk7258_ota_rpmsg_dev_s *priv = &g_bk7258_ota_rpmsg;

  (void)argc;
  (void)argv;
  for (;;)
    {
      struct bk7258_ota_rpmsg_source_s source;
      struct bk7258_ota_rpmsg_message_s complete;
      uint16_t lifecycle_command = 0u;
      uint32_t lifecycle_session = 0u;
      uint32_t lifecycle_generation = 0u;
      irqstate_t flags;
      int ret;

      if (nxsem_wait_uninterruptible(&priv->worker_sem) < 0)
        {
          continue;
        }

      flags = spin_lock_irqsave(&priv->lock);
      if (priv->lifecycle_pending)
        {
          lifecycle_command = priv->lifecycle_command;
          lifecycle_session = priv->lifecycle_session;
          lifecycle_generation = priv->lifecycle_generation;
          priv->lifecycle_pending = false;
        }
      spin_unlock_irqrestore(&priv->lock, flags);

      if (lifecycle_command != 0u)
        {
          (void)bk7258_ota_rpmsg_lifecycle_worker(lifecycle_command,
                                                   lifecycle_session,
                                                   lifecycle_generation);
          continue;
        }

      source.dev = priv;
      source.session = priv->active_session;
      ret = bk7258_ota_stage_pair(&g_bk7258_ota_proxy_ops, &source);
      flags = spin_lock_irqsave(&priv->lock);
      priv->staged_candidate_ready = ret == OK;
      if (ret == OK && ++priv->staged_candidate_epoch == 0u)
        {
          priv->staged_candidate_epoch++;
        }
      spin_unlock_irqrestore(&priv->lock, flags);
      bk7258_ota_rpmsg_header(&complete.header,
                              BK7258_OTA_RPMSG_COMPLETE,
                              source.session);
      complete.header.status = ret;
      (void)bk7258_ota_rpmsg_send(&complete, 0u);
      __atomic_store_n(&priv->stage_busy, false, __ATOMIC_RELEASE);
    }

  return 0;
}

#endif /* CONFIG_BK7258_AP_CORE */

static int bk7258_ota_rpmsg_ept_cb(FAR struct rpmsg_endpoint *ept,
                                    FAR void *data, size_t len,
                                    uint32_t src, FAR void *priv_)
{
  struct bk7258_ota_rpmsg_dev_s *priv = priv_;
  struct bk7258_ota_rpmsg_message_s *msg = data;
  irqstate_t flags;

  (void)ept;
  (void)src;
  if (!bk7258_ota_rpmsg_valid(msg, len))
    {
      return -EPROTO;
    }

#ifdef CONFIG_BK7258_AP_CORE
  if (msg->header.command == BK7258_OTA_RPMSG_CONTROL_REPLY)
    {
      flags = spin_lock_irqsave(&priv->lock);
      if (priv->waiting_control_session == 0u ||
          msg->header.session != priv->waiting_control_session)
        {
          spin_unlock_irqrestore(&priv->lock, flags);
          return -ESTALE;
        }

      priv->control_reply_status = msg->header.status;
      priv->control_reply_length = msg->header.length;
      if (msg->header.length > 0u)
        {
          memcpy(priv->control_reply, msg->payload, msg->header.length);
        }
      priv->control_reply_valid = true;
      spin_unlock_irqrestore(&priv->lock, flags);
      return nxsem_post(&priv->lifecycle_sem);
    }

  if (msg->header.command == BK7258_OTA_RPMSG_MANAGER_STATUS)
    {
      struct bk7258_ota_manager_status_s status;
      int ret;

#ifdef CONFIG_BK7258_OTA_MANAGER
      bk7258_ota_rpmsg_sync_progress(priv);
      ret = bk7258_ota_manager_get_status(&status);
#else
      memset(&status, 0, sizeof(status));
      ret = -ENOSYS;
#endif
      return bk7258_ota_rpmsg_control_reply(
               msg->header.session, ret,
               ret == 0 ? &status : NULL,
               ret == 0 ? sizeof(status) : 0u, false);
    }

  if (msg->header.command == BK7258_OTA_RPMSG_MANAGER_CANCEL)
    {
      int ret;

#ifdef CONFIG_BK7258_OTA_MANAGER
      ret = bk7258_ota_manager_cancel();
#else
      ret = -ENOSYS;
#endif
      return bk7258_ota_rpmsg_control_reply(
               msg->header.session, ret, NULL, 0u, false);
    }

  if (msg->header.command == BK7258_OTA_RPMSG_USBMODE_GET)
    {
      enum bk7258_usbmode_e mode = BK7258_USBMODE_NONE;
      uint32_t wire_mode;
      int ret;

#ifdef CONFIG_BK7258_USBMODE
      mode = bk7258_usbmode_get();
      ret = OK;
#else
      ret = -ENOSYS;
#endif
      wire_mode = (uint32_t)mode;
      return bk7258_ota_rpmsg_control_reply(
               msg->header.session, ret,
               ret == OK ? &wire_mode : NULL,
               ret == OK ? sizeof(wire_mode) : 0u, false);
    }

  if (msg->header.command == BK7258_OTA_RPMSG_USBMODE_SET)
    {
#if defined(CONFIG_BK7258_USBMODE)
      enum bk7258_usbmode_e mode;
      uint32_t wire_mode;
      bool expected = false;
      int ret;

      memcpy(&wire_mode, msg->payload, sizeof(wire_mode));
      mode = (enum bk7258_usbmode_e)wire_mode;
      if (mode != BK7258_USBMODE_CDC && mode != BK7258_USBMODE_MSC)
        {
          return bk7258_ota_rpmsg_control_reply(
                   msg->header.session, -EINVAL, NULL, 0u, false);
        }

      if (!__atomic_compare_exchange_n(&priv->control_busy, &expected, true,
                                       false, __ATOMIC_ACQ_REL,
                                       __ATOMIC_ACQUIRE))
        {
          return bk7258_ota_rpmsg_control_reply(
                   msg->header.session, -EBUSY, NULL, 0u, false);
        }

      priv->control_command = msg->header.command;
      priv->control_session = msg->header.session;
      priv->control_usbmode = mode;
      __asm volatile ("dmb sy" ::: "memory");
      ret = nxsem_post(&priv->control_sem);
      if (ret < 0)
        {
          __atomic_store_n(&priv->control_busy, false,
                           __ATOMIC_RELEASE);
          return bk7258_ota_rpmsg_control_reply(
                   msg->header.session, ret, NULL, 0u, false);
        }

      return OK;
#else
      return bk7258_ota_rpmsg_control_reply(
               msg->header.session, -ENOSYS, NULL, 0u, false);
#endif
    }

  if (msg->header.command == BK7258_OTA_RPMSG_APPLY_FILE ||
      msg->header.command == BK7258_OTA_RPMSG_APPLY_HTTP)
    {
#if defined(CONFIG_BK7258_OTA_SOURCE_FILE) || \
    defined(CONFIG_BK7258_OTA_SOURCE_HTTP)
      bool expected = false;
      const char *location = (const char *)msg->payload;
      const char *terminator;
      const char *ca_path = "";
      size_t location_size = msg->header.length;
      size_t ca_size = 1u;
      bool supported = false;

#ifdef CONFIG_BK7258_OTA_SOURCE_FILE
      supported = msg->header.command == BK7258_OTA_RPMSG_APPLY_FILE;
#endif
#ifdef CONFIG_BK7258_OTA_SOURCE_HTTP
      supported = supported ||
                  msg->header.command == BK7258_OTA_RPMSG_APPLY_HTTP;
#endif

