open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_ota_rpmsg.c
      if (!supported || msg->header.offset < 60000u ||
          msg->header.offset > 3600000u ||
          location[0] == '\0')
        {
          return bk7258_ota_rpmsg_control_reply(
                   msg->header.session, -EINVAL, NULL, 0u, false);
        }

      if (msg->header.command == BK7258_OTA_RPMSG_APPLY_FILE)
        {
          if (memchr(location, '\0', msg->header.length) !=
              location + msg->header.length - 1u ||
              msg->header.length > BK7258_OTA_CONTROL_PATH_SIZE)
            {
              return bk7258_ota_rpmsg_control_reply(
                       msg->header.session, -EINVAL, NULL, 0u, false);
            }
        }
      else
        {
          terminator = memchr(location, '\0', msg->header.length);
          if (terminator == NULL || terminator == location ||
              terminator == location + msg->header.length - 1u)
            {
              return bk7258_ota_rpmsg_control_reply(
                       msg->header.session, -EINVAL, NULL, 0u, false);
            }

          location_size = (size_t)(terminator - location) + 1u;
          ca_path = terminator + 1;
          ca_size = msg->header.length - location_size;
          if (location_size > BK7258_OTA_CONTROL_URL_SIZE ||
              ca_size > BK7258_OTA_CONTROL_CA_SIZE ||
              memchr(ca_path, '\0', ca_size) != ca_path + ca_size - 1u)
            {
              return bk7258_ota_rpmsg_control_reply(
                       msg->header.session, -EINVAL, NULL, 0u, false);
            }
        }

      if (!__atomic_compare_exchange_n(&priv->control_busy, &expected, true,
                                       false, __ATOMIC_ACQ_REL,
                                       __ATOMIC_ACQUIRE))
        {
          return bk7258_ota_rpmsg_control_reply(
                   msg->header.session, -EBUSY, NULL, 0u, false);
        }

      memset(priv->control_location, 0, sizeof(priv->control_location));
      memset(priv->control_ca_path, 0, sizeof(priv->control_ca_path));
      memcpy(priv->control_location, location, location_size);
      memcpy(priv->control_ca_path, ca_path, ca_size);
      priv->control_command = msg->header.command;
      priv->control_timeout_ms = msg->header.offset;
      __asm volatile ("dmb sy" ::: "memory");
      {
        int ret = nxsem_post(&priv->control_sem);

        if (ret < 0)
          {
            __atomic_store_n(&priv->control_busy, false,
                             __ATOMIC_RELEASE);
            return bk7258_ota_rpmsg_control_reply(
                     msg->header.session, ret, NULL, 0u, false);
          }
      }
      return bk7258_ota_rpmsg_control_reply(
               msg->header.session, 0, NULL, 0u, false);
#else
      return bk7258_ota_rpmsg_control_reply(
               msg->header.session, -ENOSYS, NULL, 0u, false);
#endif
    }

  if (!__atomic_load_n(&priv->stage_active, __ATOMIC_ACQUIRE) ||
      msg->header.session != priv->next_session)
    {
      return -ESTALE;
    }

  flags = spin_lock_irqsave(&priv->lock);
  if (msg->header.command == BK7258_OTA_RPMSG_READ)
    {
      if (priv->read_pending)
        {
          spin_unlock_irqrestore(&priv->lock, flags);
          return -EBUSY;
        }

      priv->read_request = msg->header;
      priv->read_pending = true;
    }
  else if (msg->header.command == BK7258_OTA_RPMSG_PROGRESS)
    {
      priv->progress.phase =
        (enum bk7258_ota_phase_e)msg->header.status;
      priv->progress.image =
        (enum bk7258_ota_image_e)msg->header.image;
      priv->progress.operation = BK7258_OTA_OPERATION_NONE;
      priv->progress.completed = msg->header.offset;
      priv->progress.total = msg->header.length;
      priv->progress_pending = true;
    }
  else if (msg->header.command == BK7258_OTA_RPMSG_COMPLETE)
    {
      priv->complete_session = msg->header.session;
      priv->complete_status = msg->header.status;
      priv->complete_pending = true;
    }
  else
    {
      spin_unlock_irqrestore(&priv->lock, flags);
      return -ENOMSG;
    }

  spin_unlock_irqrestore(&priv->lock, flags);
  return nxsem_post(&priv->event_sem);
#else
  if (msg->header.command == BK7258_OTA_RPMSG_CONTROL_REPLY)
    {
      flags = spin_lock_irqsave(&priv->lock);
      if (priv->waiting_control_session == 0u ||
          msg->header.session != priv->waiting_control_session)
        {
          spin_unlock_irqrestore(&priv->lock, flags);
          return -ESTALE;
        }

      priv->control_reply_status = msg->header.status;
      priv->control_reply_length = msg->header.length;
      if (msg->header.length > 0u)
        {
          memcpy(priv->control_reply, msg->payload, msg->header.length);
        }
      priv->control_reply_valid = true;
      spin_unlock_irqrestore(&priv->lock, flags);
      return nxsem_post(&priv->control_sem);
    }

  if (msg->header.command == BK7258_OTA_RPMSG_PAIR_STATUS ||
      msg->header.command == BK7258_OTA_RPMSG_REBOOT_PREPARE ||
      msg->header.command == BK7258_OTA_RPMSG_REBOOT_COMMIT)
    {
      bool expected = false;
      int ret;

      if (!__atomic_compare_exchange_n(&priv->stage_busy, &expected, true,
                                       false, __ATOMIC_ACQ_REL,
                                       __ATOMIC_ACQUIRE))
        {
          if (msg->header.command == BK7258_OTA_RPMSG_REBOOT_COMMIT)
            {
              return -EBUSY;
            }

          return bk7258_ota_rpmsg_control_reply(
                   msg->header.session, -EBUSY, NULL, 0u, false);
        }

      flags = spin_lock_irqsave(&priv->lock);
      priv->lifecycle_command = msg->header.command;
      priv->lifecycle_session = msg->header.session;
      priv->lifecycle_generation = msg->header.generation;
      priv->lifecycle_pending = true;
      spin_unlock_irqrestore(&priv->lock, flags);
      ret = nxsem_post(&priv->worker_sem);
      if (ret < 0)
        {
          flags = spin_lock_irqsave(&priv->lock);
          priv->lifecycle_pending = false;
          priv->lifecycle_command = 0u;
          priv->lifecycle_session = 0u;
          priv->lifecycle_generation = 0u;
          if (msg->header.command == BK7258_OTA_RPMSG_REBOOT_COMMIT &&
              priv->reboot_prepared &&
              priv->reboot_prepared_session == msg->header.session &&
              priv->reboot_prepared_generation == msg->header.generation)
            {
              priv->reboot_prepared = false;
            }
          spin_unlock_irqrestore(&priv->lock, flags);
          __atomic_store_n(&priv->stage_busy, false, __ATOMIC_RELEASE);
          if (msg->header.command == BK7258_OTA_RPMSG_REBOOT_COMMIT)
            {
              return ret;
            }

