open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_ota_rpmsg.c
          return bk7258_ota_rpmsg_control_reply(
                   msg->header.session, ret, NULL, 0u, false);
        }

      return OK;
    }

  if (msg->header.command == BK7258_OTA_RPMSG_START)
    {
      bool expected = false;
      struct bk7258_ota_rpmsg_message_s complete;
      int ret;

      if (msg->header.length != sizeof(priv->manifest))
        {
          return -EINVAL;
        }
      if (!__atomic_compare_exchange_n(&priv->stage_busy, &expected, true,
                                       false, __ATOMIC_ACQ_REL,
                                       __ATOMIC_ACQUIRE))
        {
          bk7258_ota_rpmsg_header(&complete.header,
                                  BK7258_OTA_RPMSG_COMPLETE,
                                  msg->header.session);
          complete.header.status = -EBUSY;
          return rpmsg_trysend(&priv->ept, &complete,
                               sizeof(complete.header)) < 0 ? -EAGAIN : OK;
        }

      flags = spin_lock_irqsave(&priv->lock);
      memcpy(&priv->manifest, msg->payload, sizeof(priv->manifest));
      priv->staged_candidate_ready = false;
      priv->reboot_prepared = false;
      spin_unlock_irqrestore(&priv->lock, flags);
      priv->active_session = msg->header.session;
      priv->cancel_requested = false;
      __asm volatile ("dmb sy" ::: "memory");
      ret = nxsem_post(&priv->worker_sem);
      if (ret < 0)
        {
          __atomic_store_n(&priv->stage_busy, false, __ATOMIC_RELEASE);
        }

      return ret;
    }

  if (msg->header.command == BK7258_OTA_RPMSG_CANCEL &&
      msg->header.session == priv->active_session)
    {
      __atomic_store_n(&priv->cancel_requested, true, __ATOMIC_RELEASE);
      (void)nxsem_post(&priv->data_sem);
      return OK;
    }

  if (msg->header.command == BK7258_OTA_RPMSG_DATA &&
      msg->header.session == priv->active_session &&
      msg->header.sequence == priv->waiting_sequence)
    {
      priv->data_status = msg->header.status;
      priv->data_length = msg->header.length;
      if (msg->header.status >= 0 &&
          msg->header.length <= sizeof(priv->data))
        {
          memcpy(priv->data, msg->payload, msg->header.length);
          priv->data_valid = true;
        }
      else
        {
          priv->data_valid = false;
        }

      __asm volatile ("dmb sy" ::: "memory");
      return nxsem_post(&priv->data_sem);
    }

  return -ENOMSG;
#endif
}

static void bk7258_ota_rpmsg_device_created(FAR struct rpmsg_device *rdev,
                                             FAR void *priv_)
{
  struct bk7258_ota_rpmsg_dev_s *priv = priv_;
  FAR const char *cpuname = rpmsg_get_cpuname(rdev);

  if (cpuname == NULL ||
      strcmp(cpuname, BK7258_OTA_RPMSG_REMOTE_NAME) != 0)
    {
      return;
    }

#ifdef CONFIG_BK7258_AP_CORE
  priv->ept.priv = priv;
  priv->connection_error = rpmsg_create_ept(
    &priv->ept, rdev, BK7258_OTA_RPMSG_EPT_NAME,
    RPMSG_ADDR_ANY, RPMSG_ADDR_ANY, bk7258_ota_rpmsg_ept_cb, NULL);
  if (priv->connection_error >= 0)
    {
      __atomic_store_n(&priv->endpoint_created, true, __ATOMIC_RELEASE);
    }
#else
  priv->connection_error = OK;
#endif
}

#ifndef CONFIG_BK7258_AP_CORE
static bool bk7258_ota_rpmsg_ns_match(FAR struct rpmsg_device *rdev,
                                      FAR void *priv_, FAR const char *name,
                                      uint32_t dest)
{
  FAR const char *cpuname = rpmsg_get_cpuname(rdev);

  (void)priv_;
  (void)dest;
  return cpuname != NULL &&
         strcmp(cpuname, BK7258_OTA_RPMSG_REMOTE_NAME) == 0 &&
         strcmp(name, BK7258_OTA_RPMSG_EPT_NAME) == 0;
}

static void bk7258_ota_rpmsg_ns_bind(FAR struct rpmsg_device *rdev,
                                     FAR void *priv_, FAR const char *name,
                                     uint32_t dest)
{
  struct bk7258_ota_rpmsg_dev_s *priv = priv_;

  priv->ept.priv = priv;
  priv->connection_error = rpmsg_create_ept(
    &priv->ept, rdev, name, RPMSG_ADDR_ANY, dest,
    bk7258_ota_rpmsg_ept_cb, NULL);
  if (priv->connection_error >= 0)
    {
      __atomic_store_n(&priv->endpoint_created, true, __ATOMIC_RELEASE);
      bk7258_rptun_mark_connected();
    }
}
#endif

static void bk7258_ota_rpmsg_device_destroy(FAR struct rpmsg_device *rdev,
                                             FAR void *priv_)
{
  struct bk7258_ota_rpmsg_dev_s *priv = priv_;
  FAR const char *cpuname = rpmsg_get_cpuname(rdev);
  irqstate_t flags;

  if (cpuname == NULL ||
      strcmp(cpuname, BK7258_OTA_RPMSG_REMOTE_NAME) != 0)
    {
      return;
    }

  __atomic_store_n(&priv->endpoint_created, false, __ATOMIC_RELEASE);
  priv->connection_error = -ENOTCONN;
  flags = spin_lock_irqsave(&priv->lock);
#ifdef CONFIG_BK7258_AP_CORE
  priv->complete_status = -ENOTCONN;
  priv->complete_session = priv->next_session;
  priv->complete_pending = true;
  priv->control_reply_status = -ENOTCONN;
  priv->control_reply_length = 0u;
  priv->control_reply_valid = true;
#else
  __atomic_store_n(&priv->cancel_requested, true, __ATOMIC_RELEASE);
  priv->control_reply_status = -ENOTCONN;
  priv->control_reply_length = 0u;
  priv->control_reply_valid = true;
  priv->reboot_prepared = false;
#endif
  spin_unlock_irqrestore(&priv->lock, flags);
#ifdef CONFIG_BK7258_AP_CORE
  (void)nxsem_post(&priv->event_sem);
  (void)nxsem_post(&priv->lifecycle_sem);
#else
  (void)nxsem_post(&priv->data_sem);
  (void)nxsem_post(&priv->control_sem);
#endif
  if (priv->ept.rdev != NULL)
    {
      rpmsg_destroy_ept(&priv->ept);
    }
}

int bk7258_ota_rpmsg_initialize(void)
{
  struct bk7258_ota_rpmsg_dev_s *priv = &g_bk7258_ota_rpmsg;
  bool expected = false;
  bool registered = false;
  bool first_sem = false;
#if !defined(CONFIG_BK7258_AP_CORE) || \
    defined(CONFIG_BK7258_OTA_SOURCE_FILE) || \
    defined(CONFIG_BK7258_OTA_SOURCE_HTTP) || \
    defined(CONFIG_BK7258_USBMODE)
  bool second_sem = false;
#endif
#ifdef CONFIG_BK7258_AP_CORE
  bool lifecycle_sem_initialized = false;
#endif
#ifndef CONFIG_BK7258_AP_CORE
  bool third_sem = false;
#endif
  int ret;

  if (!__atomic_compare_exchange_n(&priv->initialized, &expected, true,
                                   false, __ATOMIC_ACQ_REL,
                                   __ATOMIC_ACQUIRE))
    {
      return OK;
    }

#ifdef CONFIG_BK7258_AP_CORE
  ret = nxsem_init(&priv->event_sem, 0, 0);
#else
  ret = nxsem_init(&priv->worker_sem, 0, 0);
#endif
  if (ret >= 0)
    {
      first_sem = true;
    }

#ifndef CONFIG_BK7258_AP_CORE
  if (ret >= 0)
    {
      ret = nxsem_init(&priv->data_sem, 0, 0);
      second_sem = ret >= 0;
    }
#endif

#if defined(CONFIG_BK7258_AP_CORE) && \
    (defined(CONFIG_BK7258_OTA_SOURCE_FILE) || \
     defined(CONFIG_BK7258_OTA_SOURCE_HTTP) || \
     defined(CONFIG_BK7258_USBMODE))
  if (ret >= 0)
    {
      ret = nxsem_init(&priv->control_sem, 0, 0);
      second_sem = ret >= 0;
    }
#endif
#ifdef CONFIG_BK7258_AP_CORE
  if (ret >= 0)
    {
      ret = nxsem_init(&priv->lifecycle_sem, 0, 0);
      lifecycle_sem_initialized = ret >= 0;
    }
#elif !defined(CONFIG_BK7258_AP_CORE)
  if (ret >= 0)
    {
      ret = nxsem_init(&priv->control_sem, 0, 0);
      third_sem = ret >= 0;
    }
#endif

  if (ret >= 0)
    {
      ret = rpmsg_register_callback(priv,
                                    bk7258_ota_rpmsg_device_created,
                                    bk7258_ota_rpmsg_device_destroy,
#ifdef CONFIG_BK7258_AP_CORE
                                    NULL, NULL);
#else
                                    bk7258_ota_rpmsg_ns_match,
                                    bk7258_ota_rpmsg_ns_bind);
#endif
      registered = ret >= 0;
    }

#if defined(CONFIG_BK7258_AP_CORE) && \
    (defined(CONFIG_BK7258_OTA_SOURCE_FILE) || \
     defined(CONFIG_BK7258_OTA_SOURCE_HTTP) || \
     defined(CONFIG_BK7258_USBMODE))
  if (ret >= 0)
    {
      pid_t pid;

      pid = kthread_create("bk7258-ota-apctl",
                           CONFIG_BK7258_OTA_RPMSG_PRIORITY,
                           CONFIG_BK7258_OTA_RPMSG_AP_STACKSIZE,
                           bk7258_ota_rpmsg_control_worker, NULL);
      ret = (int)pid;
      if (pid >= 0)
        {
#ifdef CONFIG_SMP
          cpu_set_t cpuset;

          CPU_ZERO(&cpuset);
          CPU_SET(0, &cpuset);
          ret = sched_setaffinity(pid, sizeof(cpuset), &cpuset);
          if (ret < 0)
            {
              kthread_delete(pid);
            }
#else
          ret = OK;
#endif
        }
    }
#elif !defined(CONFIG_BK7258_AP_CORE)
  if (ret >= 0)
    {
      ret = kthread_create("bk7258-ota-cp",
                           CONFIG_BK7258_OTA_RPMSG_PRIORITY,
                           CONFIG_BK7258_OTA_RPMSG_STACKSIZE,
                           bk7258_ota_rpmsg_worker, NULL);
      if (ret >= 0)
        {
          ret = OK;
        }
    }
#endif

  if (ret < 0)
    {
      if (registered)
        {
          rpmsg_unregister_callback(priv,
                                    bk7258_ota_rpmsg_device_created,
                                    bk7258_ota_rpmsg_device_destroy,
#ifdef CONFIG_BK7258_AP_CORE
                                    NULL, NULL);
#else
                                    bk7258_ota_rpmsg_ns_match,
                                    bk7258_ota_rpmsg_ns_bind);
#endif
        }
#ifndef CONFIG_BK7258_AP_CORE
      if (third_sem)
        {
          (void)nxsem_destroy(&priv->control_sem);
        }
      if (second_sem)
        {
          (void)nxsem_destroy(&priv->data_sem);
        }
#else
      if (lifecycle_sem_initialized)
        {
          (void)nxsem_destroy(&priv->lifecycle_sem);
        }
#if defined(CONFIG_BK7258_OTA_SOURCE_FILE) || \
    defined(CONFIG_BK7258_OTA_SOURCE_HTTP) || \
    defined(CONFIG_BK7258_USBMODE)
      if (second_sem)
        {
          (void)nxsem_destroy(&priv->control_sem);
        }
#endif
#endif
      if (first_sem)
        {
#ifdef CONFIG_BK7258_AP_CORE
          (void)nxsem_destroy(&priv->event_sem);
#else
          (void)nxsem_destroy(&priv->worker_sem);
#endif
        }

      memset(&priv->ept, 0, sizeof(priv->ept));
      __atomic_store_n(&priv->endpoint_created, false, __ATOMIC_RELEASE);
      priv->connection_error = ret;
      __atomic_store_n(&priv->initialized, false, __ATOMIC_RELEASE);
    }

  return ret;
}

#endif /* CONFIG_BK7258_OTA_RPMSG */
